Groupby

In [3]:
import pandas as pd

In [5]:
var1 = pd.DataFrame({"Name":["a","b","c","d","a","b","c","c","d","a"],
                    "s_1":[22,43,45,65,32,22,43,46,75,23],
                     "s_2":[12,23,35,45,52,32,23,26,25,23]
                    })

In [7]:
var1

  Name  s_1  s_2
0    a   22   12
1    b   43   23
2    c   45   35
3    d   65   45
4    a   32   52
5    b   22   32
6    c   43   23
7    c   46   26
8    d   75   25
9    a   23   23

In [13]:
var_new = var1.groupby("Name")
var_new

In [19]:
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  Name  s_1  s_2
0    a   22   12
4    a   32   52
9    a   23   23

b
  Name  s_1  s_2
1    b   43   23
5    b   22   32

c
  Name  s_1  s_2
2    c   45   35
6    c   43   23
7    c   46   26

d
  Name  s_1  s_2
3    d   65   45
8    d   75   25

In [21]:
 var_new.get_group("a")

  Name  s_1  s_2
0    a   22   12
4    a   32   52
9    a   23   23

In [23]:
var_new.get_group("b")

  Name  s_1  s_2
1    b   43   23
5    b   22   32

In [25]:
var_new.min()

      s_1  s_2
Name
a      22   12
b      22   23
c      43   23
d      65   25

In [27]:
var_new.max()

      s_1  s_2
Name
a      32   52
b      43   32
c      46   35
d      75   45

In [29]:
var_new.mean()

            s_1   s_2
Name
a     25.666667  29.0
b     32.500000  27.5
c     44.666667  28.0
d     70.000000  35.0

In [31]:
li = list(var_new)
li

[('a',
    Name  s_1  s_2
  0    a   22   12
  4    a   32   52
  9    a   23   23),
 ('b',
    Name  s_1  s_2
  1    b   43   23
  5    b   22   32),
 ('c',
    Name  s_1  s_2
  2    c   45   35
  6    c   43   23
  7    c   46   26),
 ('d',
    Name  s_1  s_2
  3    d   65   45
  8    d   75   25)]